UNK
/
takesCourse
type
name
publicationAuthor
telephone
"xxx-xxx-xxxx"
emailAddress
memberOf
UndergraduateStudent
Publication
advisor
Department0.University3
University
Department1.University0
Department0.University2
undergraduateDegreeFrom
GraduateStudent
teacherOf
Course
GraduateCourse
ResearchAssistant
doctoralDegreeFrom
worksFor
mastersDegreeFrom
"Publication0"
"Publication1"
"Publication2"
"Publication3"
"Publication4"
researchInterest
TeachingAssistant
teachingAssistantOf
"Publication5"
"Publication6"
"Publication7"
"Publication8"
"Publication9"
subOrganizationOf
"Publication10"
ResearchGroup
"Publication11"
Department1.University0/FullProfessor4
"Publication12"
Department0.University3/FullProfessor6
Department0.University2/FullProfessor5
"Publication13"
Department0.University2/FullProfessor7
Department1.University0/Course42
Department0.University3/Course43
Department0.University2/FullProfessor1
Department0.University2/FullProfessor2
"Publication14"
Department0.University2/FullProfessor3
Department0.University2/Course25
Department0.University3/AssociateProfessor3
Department0.University2/Course16
Department1.University0/FullProfessor1
Department0.University2/FullProfessor6
Department0.University2/FullProfessor4
Department0.University3/FullProfessor7
Department1.University0/Course39
Department1.University0/FullProfessor3
Department0.University3/FullProfessor3
Department0.University3/Course26
Department0.University3/FullProfessor2
Department1.University0/AssociateProfessor1
Department1.University0/Course5
Department0.University3/AssociateProfessor7
Department1.University0/Course47
Department1.University0/FullProfessor9
Department0.University3/FullProfessor4
Department1.University0/Course1
Department0.University2/AssociateProfessor7
Department0.University3/Course44
Department0.University2/Course20
Department0.University3/Course22
Department0.University2/AssociateProfessor5
Department0.University3/FullProfessor1
Department1.University0/FullProfessor5
Department1.University0/FullProfessor8
Department0.University3/Course12
Department0.University2/Course21
Department0.University2/Course12
Department0.University2/AssociateProfessor4
Department0.University3/Course39
Department1.University0/Course3
Department0.University3/Course18
Department1.University0/Course20
Department1.University0/Course44
Department1.University0/Course4
Department1.University0/FullProfessor0
Department1.University0/Course34
Department0.University3/AssociateProfessor1
Department1.University0/Course23
Department0.University2/FullProfessor0
Department0.University2/AssociateProfessor2
Department0.University3/FullProfessor0
Department1.University0/AssistantProfessor2
Department1.University0/FullProfessor6
Department0.University3/Course47
Department1.University0/Course26
Department1.University0/AssociateProfessor5
Department0.University2/Course30
Department1.University0/AssociateProfessor0
Department0.University3/FullProfessor8
Department1.University0/Course13
Department0.University3/Course28
Department0.University3/Course24
Department0.University3/Course23
Department0.University3/Course0
Department1.University0/AssociateProfessor6
Department0.University3/Course27
Department1.University0/Course15
Department1.University0/Course11
Department0.University2/AssociateProfessor0
Department0.University2/AssociateProfessor3
Department0.University3/FullProfessor5
Department0.University2/AssociateProfessor1
Department0.University2/Course19
Department0.University3/AssociateProfessor6
Department0.University3/AssociateProfessor8
Department0.University2/Course34
Department0.University3/Course20
Department1.University0/Course32
Department1.University0/Course22
Department0.University2/Course0
Department0.University3/Course45
Department0.University3/AssociateProfessor5
Department1.University0/AssistantProfessor0
Department1.University0/FullProfessor2
Department0.University3/AssistantProfessor10
Department0.University3/Course11
Department0.University3/Course1
Department1.University0/Course21
Department0.University3/Course7
Department0.University2/AssistantProfessor5
Department1.University0/AssociateProfessor2
Department1.University0/Course45
Department0.University3/Course14
Department0.University2/Course36
Department0.University3/Course29
Department0.University3/AssociateProfessor9
Department0.University3/AssociateProfessor0
Department0.University2/Course15
Department0.University2/Course42
Department1.University0/AssociateProfessor7
Department1.University0/AssociateProfessor8
Department1.University0/AssistantProfessor4
"Publication15"
Department0.University3/Course48
Department0.University2/AssociateProfessor9
Department0.University3/Course33
Department1.University0/FullProfessor7
Department0.University3/Course10
Department0.University3/Course38
Department0.University3/AssociateProfessor4
Department1.University0/Course9
Department0.University3/Course19
Department0.University3/AssistantProfessor7
Department0.University3/Course30
Department0.University2/Course6
Department0.University3/Course32
Department0.University2/AssistantProfessor3
Department0.University2/Course3
Department0.University2/Course1
Department0.University2/Course32
Department1.University0/Course30
AssociateProfessor
Department1.University0/Course10
Department0.University3/AssistantProfessor5
Department0.University3/AssistantProfessor8
Department1.University0/Course8
Department0.University2/Course26
Department0.University2/Course5
Department0.University3/Course5
Department1.University0/Course6
Department0.University2/Course45
Department1.University0/Course28
Department1.University0/Course25
Department0.University3/Course31
Department0.University3/Course36
Department1.University0/AssociateProfessor3
Department0.University2/AssociateProfessor8
Department1.University0/AssistantProfessor1
Department0.University3/Course46
Department0.University3/Course42
Department1.University0/Course0
Department1.University0/Course14
Department0.University3/AssistantProfessor6
Department0.University3/Course35
Department1.University0/AssociateProfessor9
Department0.University2/Course22
Department1.University0/Course38
Department0.University3/AssociateProfessor2
Department0.University2/AssistantProfessor2
AssistantProfessor
Department0.University2/AssistantProfessor4
Department0.University2/AssociateProfessor6
Department1.University0/Course19
Department0.University2/AssistantProfessor1
Department0.University2/AssistantProfessor0
Department0.University3/Course17
Department1.University0/AssociateProfessor4
Department0.University2/Course33
Department0.University3/Course16
Department0.University2/Course31
Department0.University3/Course21
Department1.University0/AssistantProfessor3
Department0.University3/Course40
Department0.University3/Course34
FullProfessor
Department0.University2/Course9
Department1.University0/Course46
Department1.University0/Course37
Department0.University2/Course29
Department0.University2/Course41
Department0.University3/Course4
Department0.University2/Course38
Department0.University2/AssistantProfessor7
Department0.University2/Course17
Department1.University0/Course41
Department0.University2/Course18
Department1.University0/AssistantProfessor5
Department1.University0/Course36
Department0.University3/Course37
Department0.University2/Course23
Department0.University2/Course39
Department0.University2/Course4
Department0.University2/Course8
Department1.University0/Course17
Department0.University2/AssistantProfessor6
Department1.University0/Course27
Department0.University3/Course41
Department1.University0/AssistantProfessor7
Department0.University2/Course28
Department1.University0/Course29
Department0.University3/Course6
Department0.University2/Course40
Department0.University2/Course14
Department0.University3/Course2
Department1.University0/Course18
Department1.University0/Course24
Department0.University3/AssistantProfessor9
Department0.University3/Course9
Department0.University2/Course43
Department1.University0/Course31
Department0.University2/Course35
Department0.University2/Course7
Department0.University3/AssistantProfessor1
Department0.University2/Course10
Department0.University2/Course2
Department1.University0/Course35
Department0.University3/Course15
Department1.University0/AssistantProfessor6
Department0.University2/Course27
Department0.University3/Course3
Department0.University3/Course8
Department1.University0/Course43
Department1.University0/Course33
Department0.University3/Course13
Department0.University2/Course11
Department0.University3/AssistantProfessor2
Department1.University0/Course7
Department0.University3/AssistantProfessor4
Department0.University3/Course25
"Publication16"
Department0.University3/AssistantProfessor3
Department1.University0/Course40
Department0.University2/Course13
Department0.University2/Course24
Department0.University3/AssistantProfessor0
Department0.University2/Course44
Department1.University0/Course2
Department0.University2/Course37
Department1.University0/Course16
Department1.University0/Course12
Department1.University0/Lecturer5
Department0.University3/GraduateStudent71
Department1.University0/GraduateStudent28
Department0.University3/GraduateStudent45
Department0.University2/GraduateStudent91
Department0.University2/GraduateStudent122
Department0.University2/GraduateStudent14
Department0.University3/GraduateStudent30
Department0.University3/GraduateStudent76
Lecturer
Department0.University3/GraduateStudent94
Department0.University3/GraduateStudent24
Department0.University2/GraduateStudent34
Department1.University0/GraduateStudent2
Department0.University2/GraduateStudent30
Department0.University2/GraduateStudent3
Department0.University2/GraduateStudent118
Department0.University2/GraduateStudent86
Department1.University0/GraduateStudent54
Department1.University0/Lecturer4
Department0.University2/GraduateStudent25
Department0.University3/GraduateStudent12
Department1.University0/GraduateStudent34
Department1.University0/GraduateStudent24
Department0.University2/GraduateStudent64
Department0.University2/GraduateStudent113
Department0.University3/GraduateStudent108
Department0.University3/Lecturer3
Department0.University3/GraduateStudent57
Department0.University3/GraduateStudent15
Department0.University3/GraduateStudent4
Department0.University3/GraduateStudent66
Department1.University0/GraduateStudent103
Department0.University3/GraduateStudent115
Department0.University3/GraduateStudent35
Department0.University3/GraduateStudent40
Department1.University0/GraduateStudent3
Department0.University3/GraduateStudent95
Department0.University3/GraduateStudent55
Department0.University3/GraduateStudent101
Department0.University2/GraduateStudent101
Department0.University3/Lecturer4
Department0.University2/GraduateStudent18
Department0.University2/GraduateStudent85
Department0.University2/GraduateStudent32
Department1.University0/GraduateStudent81
Department0.University3/GraduateStudent2
Department0.University3/GraduateStudent110
Department1.University0/GraduateStudent16
Department1.University0/Lecturer3
Department0.University3/GraduateStudent49
Department0.University3/GraduateStudent75
Department0.University3/GraduateStudent50
Department0.University3/GraduateStudent97
Department0.University3/GraduateStudent44
Department0.University2/Lecturer3
"Publication17"
Department0.University2/GraduateStudent123
Department0.University3/GraduateStudent1
Department1.University0/GraduateStudent20
Department0.University3/GraduateStudent92
Department1.University0/GraduateStudent99
Department0.University2/GraduateStudent0
Department1.University0/GraduateStudent72
Department0.University2/GraduateStudent44
Department0.University2/GraduateStudent49
Department0.University2/GraduateStudent71
Department1.University0/GraduateStudent65
Department1.University0/GraduateStudent76
Department1.University0/GraduateStudent75
Department0.University3/GraduateStudent63
Department0.University2/GraduateStudent28
Department0.University2/GraduateStudent31
Department0.University2/GraduateStudent76
Department0.University3/GraduateStudent54
Department0.University3/GraduateStudent109
Department0.University3/GraduateStudent26
Department0.University2/GraduateStudent23
Department0.University2/GraduateStudent80
Department1.University0/GraduateStudent46
Department1.University0/GraduateStudent30
Department0.University2/GraduateStudent77
Department0.University2/GraduateStudent41
Department1.University0/GraduateStudent43
Department1.University0/GraduateStudent6
Department0.University2/GraduateStudent36
Department1.University0/GraduateStudent101
Department0.University3/Lecturer1
Department0.University3/GraduateStudent102
Department0.University2/GraduateStudent67
Department1.University0/GraduateStudent19
Department1.University0/GraduateStudent11
Department1.University0/GraduateStudent26
Department0.University3/GraduateStudent121
Department0.University3/GraduateStudent60
Department0.University2/GraduateStudent58
Department0.University3/GraduateStudent9
Department1.University0/GraduateStudent38
Department1.University0/GraduateStudent107
Department1.University0/GraduateStudent60
Department1.University0/GraduateStudent109
Department1.University0/GraduateStudent18
Department0.University2/GraduateStudent115
Department0.University2/GraduateStudent105
Department0.University3/GraduateStudent8
Department0.University2/GraduateStudent65
Department0.University2/GraduateStudent33
Department0.University2/GraduateStudent66
Department0.University2/GraduateCourse15
Department0.University2/GraduateCourse24
Department0.University2/GraduateStudent17
Department1.University0/GraduateStudent63
Department1.University0/GraduateStudent41
Department0.University3/GraduateStudent90
Department1.University0/GraduateStudent82
Department1.University0/GraduateStudent69
Department0.University3/GraduateStudent51
Department1.University0/Lecturer2
Department1.University0/GraduateStudent45
Department1.University0/GraduateStudent102
Department0.University3/GraduateStudent98
Department1.University0/GraduateStudent71
Department1.University0/GraduateStudent83
Department0.University2/GraduateStudent46
Department0.University2/GraduateStudent1
Department0.University3/GraduateStudent77
Department1.University0/GraduateStudent4
Department0.University3/GraduateStudent39
Department0.University3/GraduateStudent70
Department0.University3/GraduateStudent62
Department1.University0/GraduateStudent70
Department0.University3/GraduateStudent73
Department0.University2/GraduateStudent75
Department1.University0/GraduateStudent58
Department0.University3/GraduateStudent114
Department0.University2/GraduateStudent12
Department0.University3/GraduateStudent32
Department0.University3/GraduateStudent52
Department1.University0/GraduateStudent74
Department0.University3/GraduateStudent53
Department0.University3/GraduateStudent123
Department0.University2/GraduateStudent73
Department0.University2/GraduateStudent47
Department0.University3/GraduateStudent113
Department1.University0/GraduateStudent33
Department1.University0/GraduateStudent51
Department0.University2/GraduateStudent40
Department1.University0/GraduateStudent42
Department0.University3/GraduateStudent58
Department0.University3/GraduateStudent64
Department0.University3/GraduateCourse49
Department0.University2/GraduateStudent37
Department1.University0/GraduateStudent68
Department1.University0/GraduateStudent8
Department1.University0/GraduateStudent55
Department1.University0/GraduateStudent66
Department0.University3/GraduateStudent22
Department0.University2/GraduateStudent92
Department0.University2/GraduateStudent72
Department0.University3/GraduateStudent107
Department0.University2/GraduateStudent81
Department0.University2/GraduateStudent48
Department0.University3/GraduateStudent13
Department1.University0/GraduateStudent57
Department0.University3/GraduateStudent10
Department0.University2/GraduateStudent82
Department0.University2/GraduateCourse5
Department1.University0/GraduateStudent88
Department0.University2/GraduateStudent99
Department1.University0/GraduateStudent78
Department0.University2/GraduateStudent24
Department1.University0/GraduateStudent15
Department0.University2/GraduateStudent102
Department1.University0/GraduateStudent14
Department0.University2/GraduateStudent112
Department0.University2/GraduateStudent52
Department1.University0/GraduateStudent93
Department0.University2/GraduateStudent98
Department0.University3/GraduateStudent87
Department1.University0/GraduateStudent13
Department1.University0/GraduateStudent79
Department1.University0/GraduateStudent29
Department1.University0/GraduateStudent100
Department0.University2/GraduateStudent62
Department0.University2/GraduateCourse43
Department0.University2/GraduateStudent10
Department0.University3/GraduateStudent11
Department0.University2/GraduateStudent109
Department0.University3/Lecturer2
Department0.University3/GraduateStudent25
Department0.University3/GraduateStudent42
Department1.University0/GraduateStudent35
Department1.University0/GraduateStudent67
Department1.University0/GraduateStudent80
Department0.University3/GraduateStudent67
Department0.University2/GraduateStudent26
Department0.University2/GraduateStudent94
Department0.University2/GraduateStudent59
Department1.University0/Lecturer0
Department1.University0/GraduateStudent32
Department0.University3/GraduateStudent122
Department1.University0/GraduateStudent91
Department0.University2/GraduateStudent106
Department0.University2/GraduateStudent100
Department1.University0/Lecturer1
Department0.University2/GraduateStudent55
Department0.University3/GraduateStudent5
Department1.University0/GraduateStudent73
Department0.University2/GraduateCourse35
Department0.University3/GraduateStudent16
Department0.University3/GraduateStudent56
Department0.University3/GraduateStudent69
Department1.University0/GraduateStudent96
Department0.University3/GraduateStudent61
Department1.University0/GraduateStudent37
Department1.University0/GraduateStudent40
Department0.University3/GraduateStudent78
Department0.University2/GraduateStudent4
Department0.University2/GraduateStudent21
Department0.University2/GraduateStudent84
Department0.University3/Lecturer0
Department0.University3/GraduateCourse44
Department0.University3/GraduateStudent74
Department0.University2/GraduateStudent110
Department0.University3/GraduateStudent33
Department0.University2/GraduateStudent53
Department1.University0/GraduateCourse30
Department0.University2/GraduateStudent103
Department1.University0/GraduateStudent62
Department0.University2/GraduateStudent95
Department0.University2/GraduateStudent89
Department1.University0/GraduateStudent61
Department1.University0/GraduateStudent104
Department1.University0/GraduateStudent0
Department0.University2/GraduateStudent78
Department0.University3/GraduateStudent104
Department0.University3/GraduateStudent19
Department1.University0/GraduateStudent106
Department0.University3/GraduateStudent6
Department0.University2/Lecturer4
Department0.University3/GraduateStudent46
Department0.University3/GraduateStudent27
Department1.University0/GraduateStudent9
Department0.University2/GraduateStudent38
Department0.University3/GraduateStudent43
Department0.University3/GraduateStudent79
Department0.University3/GraduateStudent111
Department0.University2/GraduateStudent27
Department1.University0/GraduateStudent89
Department0.University2/GraduateStudent35
Department0.University3/GraduateStudent124
Department0.University3/GraduateStudent81
Department0.University3/GraduateStudent34
Department1.University0/GraduateStudent22
Department0.University3/GraduateStudent72
Department0.University2/GraduateStudent107
Department1.University0/GraduateStudent92
Department0.University2/GraduateStudent90
Department0.University2/GraduateStudent42
Department0.University3/GraduateStudent31
Department1.University0/GraduateStudent97
Department0.University2/GraduateCourse22
Department0.University3/GraduateStudent3
Department0.University2/GraduateCourse40
Department0.University3/GraduateStudent91
Department0.University2/GraduateStudent22
Department0.University2/GraduateStudent15
Department0.University3/GraduateStudent116
Department0.University3/GraduateStudent59
Department0.University3/GraduateStudent89
Department0.University2/GraduateStudent83
Department1.University0/GraduateStudent90
Department1.University0/GraduateStudent36
Department0.University3/GraduateCourse35
Department0.University3/GraduateStudent80
Department0.University2/GraduateStudent43
Department0.University2/GraduateStudent87
Department0.University3/GraduateStudent37
Department1.University0/GraduateCourse14
Department0.University2/GraduateStudent104
Department0.University3/GraduateStudent86
Department0.University2/GraduateCourse30
Department1.University0/GraduateCourse17
Department0.University2/GraduateStudent16
Department1.University0/GraduateStudent31
Department0.University3/GraduateStudent88
Department0.University2/GraduateStudent8
Department0.University2/GraduateStudent19
Department1.University0/GraduateStudent94
Department0.University3/GraduateStudent119
Department1.University0/GraduateStudent48
Department1.University0/GraduateStudent56
Department0.University2/GraduateStudent57
Department0.University3/GraduateStudent93
Department1.University0/GraduateStudent59
Department0.University2/GraduateStudent116
Department1.University0/GraduateStudent5
Department0.University3/GraduateCourse11
Department0.University2/GraduateStudent29
Department0.University2/GraduateCourse45
Department0.University2/Lecturer2
Department0.University3/GraduateStudent84
Department0.University2/GraduateCourse20
Department0.University2/GraduateStudent56
Department1.University0/GraduateStudent86
Department0.University2/Lecturer1
Department1.University0/GraduateStudent21
Department0.University3/GraduateCourse29
Department0.University3/GraduateStudent103
Department0.University3/GraduateCourse9
Department0.University3/GraduateStudent82
Department0.University2/GraduateStudent121
Department0.University2/GraduateStudent39
Department0.University3/GraduateStudent106
Department0.University3/GraduateStudent96
Department0.University2/GraduateStudent68
Department0.University2/GraduateStudent9
Department0.University3/GraduateStudent48
Department0.University3/UndergraduateStudent416
Department0.University2/UndergraduateStudent315
Department0.University2/GraduateStudent97
Department0.University3/UndergraduateStudent28
Department0.University3/UndergraduateStudent302
Department0.University2/UndergraduateStudent81
Department0.University2/GraduateStudent69
Department1.University0/UndergraduateStudent283
Department1.University0/UndergraduateStudent379
Department0.University3/UndergraduateStudent349
Department0.University3/UndergraduateStudent163
Department0.University2/GraduateCourse7
Department1.University0/GraduateStudent27
Department0.University2/UndergraduateStudent21
Department1.University0/UndergraduateStudent246
Department0.University3/GraduateStudent0
Department1.University0/UndergraduateStudent224
Department0.University3/UndergraduateStudent0
Department0.University2/GraduateStudent6
Department0.University2/GraduateStudent7
Department0.University2/UndergraduateStudent185
Department0.University2/UndergraduateStudent199
Department0.University2/UndergraduateStudent63
Department1.University0/GraduateCourse29
Department0.University3/UndergraduateStudent5
Department0.University2/UndergraduateStudent310
Department1.University0/UndergraduateStudent126
Department1.University0/GraduateStudent39
Department1.University0/UndergraduateStudent21
Department0.University2/GraduateCourse26
Department0.University2/GraduateStudent96
Department1.University0/UndergraduateStudent157
Department1.University0/UndergraduateStudent66
Department0.University3/UndergraduateStudent86
Department1.University0/GraduateCourse39
Department0.University3/GraduateStudent85
Department1.University0/UndergraduateStudent269
Department1.University0/UndergraduateStudent397
Department0.University2/UndergraduateStudent67
Department1.University0/GraduateStudent77
Department1.University0/GraduateStudent52
Department0.University3/UndergraduateStudent296
Department0.University2/GraduateCourse28
Department0.University2/GraduateStudent74
Department0.University2/GraduateStudent79
Department0.University3/UndergraduateStudent369
Department0.University3/UndergraduateStudent129
Department0.University2/UndergraduateStudent138
Department0.University2/UndergraduateStudent186
Department0.University3/UndergraduateStudent337
Department0.University3/UndergraduateStudent204
Department1.University0/UndergraduateStudent78
Department0.University3/UndergraduateStudent378
Department0.University2/GraduateStudent50
Department1.University0/UndergraduateStudent356
Department0.University3/GraduateStudent100
Department0.University3/UndergraduateStudent267
Department0.University2/UndergraduateStudent79
Department0.University3/GraduateStudent7
Department0.University3/UndergraduateStudent275
Department0.University3/UndergraduateStudent288
Department0.University3/GraduateStudent65
Department0.University2/GraduateStudent5
Department0.University3/UndergraduateStudent350
Department0.University3/GraduateStudent99
Department0.University3/GraduateCourse5
Department1.University0/UndergraduateStudent195
Department1.University0/UndergraduateStudent293
Department0.University2/GraduateStudent111
Department1.University0/UndergraduateStudent75
Department0.University3/GraduateStudent117
Department1.University0/GraduateStudent10
Department1.University0/UndergraduateStudent328
Department1.University0/UndergraduateStudent340
Department1.University0/UndergraduateStudent169
Department1.University0/GraduateStudent53
Department1.University0/GraduateCourse27
Department1.University0/GraduateCourse19
Department1.University0/UndergraduateStudent151
Department1.University0/GraduateStudent98
Department0.University3/UndergraduateStudent233
Department0.University2/UndergraduateStudent290
Department0.University2/UndergraduateStudent243
Department1.University0/GraduateCourse33
Department1.University0/GraduateStudent17
Department0.University2/UndergraduateStudent141
Department1.University0/UndergraduateStudent219
Department0.University2/UndergraduateStudent188
Department1.University0/GraduateStudent12
Department1.University0/GraduateStudent47
Department0.University3/GraduateStudent120
Department0.University2/GraduateCourse41
Department0.University3/GraduateCourse41
Department1.University0/GraduateStudent1
Department0.University3/UndergraduateStudent47
Department0.University2/UndergraduateStudent217
Department0.University3/UndergraduateStudent244
Department1.University0/GraduateStudent84
Department1.University0/UndergraduateStudent17
Department1.University0/UndergraduateStudent198
Department0.University2/UndergraduateStudent82
Department0.University3/GraduateCourse16
Department0.University3/UndergraduateStudent83
Department0.University2/UndergraduateStudent133
Department1.University0/UndergraduateStudent285
Department0.University2/GraduateStudent45
Department1.University0/UndergraduateStudent264
Department0.University2/UndergraduateStudent291
Department0.University2/GraduateStudent63
Department1.University0/GraduateStudent49
Department0.University2/Lecturer0
Department0.University3/UndergraduateStudent252
Department1.University0/UndergraduateStudent407
Department0.University2/UndergraduateStudent15
Department0.University2/UndergraduateStudent253
Department0.University2/GraduateStudent93
Department0.University3/UndergraduateStudent35
Department0.University2/UndergraduateStudent78
Department0.University3/UndergraduateStudent122
Department1.University0/UndergraduateStudent273
Department0.University2/UndergraduateStudent147
Department1.University0/UndergraduateStudent244
Department1.University0/GraduateStudent44
Department1.University0/UndergraduateStudent259
Department0.University2/UndergraduateStudent295
Department0.University2/UndergraduateStudent202
Department0.University3/UndergraduateStudent376
Department0.University2/GraduateCourse9
Department0.University3/UndergraduateStudent123
Department1.University0/GraduateStudent87
Department1.University0/UndergraduateStudent330
Department0.University3/UndergraduateStudent409
Department0.University2/UndergraduateStudent39
Department1.University0/UndergraduateStudent26
Department0.University3/GraduateStudent41
Department0.University2/GraduateCourse31
Department0.University2/GraduateStudent61
Department0.University2/GraduateCourse29
Department0.University2/GraduateStudent120
Department0.University3/GraduateStudent38
Department0.University3/UndergraduateStudent266
Department0.University3/GraduateStudent28
Department0.University3/UndergraduateStudent228
Department1.University0/GraduateStudent64
Department0.University2/UndergraduateStudent136
Department0.University3/UndergraduateStudent115
Department1.University0/UndergraduateStudent344
Department0.University2/GraduateStudent54
Department0.University2/UndergraduateStudent123
Department0.University3/UndergraduateStudent298
Department1.University0/GraduateCourse41
Department0.University3/UndergraduateStudent169
Department0.University2/UndergraduateStudent111
Department0.University3/UndergraduateStudent87
Department1.University0/UndergraduateStudent267
Department0.University3/UndergraduateStudent61
Department1.University0/UndergraduateStudent376
Department0.University3/GraduateStudent68
Department0.University2/UndergraduateStudent173
Department1.University0/GraduateStudent7
Department0.University2/UndergraduateStudent312
Department0.University3/UndergraduateStudent274
Department1.University0/UndergraduateStudent196
Department0.University3/UndergraduateStudent270
Department1.University0/UndergraduateStudent101
Department1.University0/UndergraduateStudent263
Department0.University3/UndergraduateStudent193
Department1.University0/UndergraduateStudent306
Department1.University0/UndergraduateStudent215
Department0.University2/GraduateStudent114
Department1.University0/UndergraduateStudent406
Department0.University2/UndergraduateStudent264
Department0.University2/UndergraduateStudent0
Department0.University3/GraduateStudent14
Department1.University0/UndergraduateStudent320
Department1.University0/GraduateCourse22
Department1.University0/UndergraduateStudent348
Department0.University2/UndergraduateStudent234
Department0.University3/UndergraduateStudent371
Department1.University0/UndergraduateStudent358
Department0.University2/UndergraduateStudent239
Department0.University3/UndergraduateStudent299
Department1.University0/UndergraduateStudent336
Department1.University0/UndergraduateStudent6
Department0.University2/GraduateStudent13
Department0.University3/UndergraduateStudent268
Department1.University0/UndergraduateStudent127
Department1.University0/UndergraduateStudent203
Department0.University2/UndergraduateStudent270
Department1.University0/UndergraduateStudent343
Department0.University3/UndergraduateStudent19
Department1.University0/UndergraduateStudent368
Department0.University2/UndergraduateStudent11
Department0.University2/UndergraduateStudent102
Department0.University2/UndergraduateStudent228
Department0.University2/UndergraduateStudent355
Department0.University2/UndergraduateStudent43
Department0.University2/UndergraduateStudent309
Department0.University2/UndergraduateStudent5
Department0.University3/GraduateStudent36
Department1.University0/UndergraduateStudent404
Department1.University0/UndergraduateStudent47
Department1.University0/UndergraduateStudent25
Department0.University2/UndergraduateStudent357
Department1.University0/UndergraduateStudent2
Department0.University2/GraduateStudent2
Department0.University2/GraduateStudent117
Department0.University2/UndergraduateStudent75
Department1.University0/UndergraduateStudent303
Department0.University2/UndergraduateStudent166
Department1.University0/UndergraduateStudent32
Department0.University3/UndergraduateStudent207
Department0.University2/UndergraduateStudent237
Department0.University2/UndergraduateStudent328
Department1.University0/UndergraduateStudent409
Department1.University0/UndergraduateStudent236
Department1.University0/UndergraduateStudent146
Department1.University0/UndergraduateStudent350
Department0.University2/UndergraduateStudent251
Department1.University0/UndergraduateStudent222
Department0.University3/UndergraduateStudent335
Department1.University0/UndergraduateStudent332
Department1.University0/UndergraduateStudent107
Department0.University3/GraduateStudent83
Department0.University3/UndergraduateStudent121
Department1.University0/UndergraduateStudent97
Department0.University2/UndergraduateStudent172
Department1.University0/UndergraduateStudent147
Department0.University2/UndergraduateStudent72
Department0.University3/GraduateStudent23
Department0.University2/GraduateStudent11
Department0.University2/GraduateStudent51
Department0.University2/UndergraduateStudent306
Department1.University0/UndergraduateStudent314
Department0.University2/UndergraduateStudent99
Department0.University2/UndergraduateStudent218
Department1.University0/UndergraduateStudent116
Department0.University2/UndergraduateStudent160
Department1.University0/UndergraduateStudent120
Department0.University2/UndergraduateStudent112
Department0.University3/UndergraduateStudent201
Department0.University2/UndergraduateStudent294
Department1.University0/UndergraduateStudent165
Department1.University0/GraduateCourse28
Department0.University2/UndergraduateStudent301
Department1.University0/UndergraduateStudent143
Department0.University3/GraduateStudent125
Department1.University0/UndergraduateStudent245
Department0.University2/UndergraduateStudent311
Department0.University2/UndergraduateStudent145
Department0.University3/UndergraduateStudent407
Department0.University2/UndergraduateStudent330
Department1.University0/UndergraduateStudent31
Department1.University0/UndergraduateStudent54
Department0.University2/UndergraduateStudent299
Department1.University0/UndergraduateStudent323
Department0.University3/UndergraduateStudent237
Department1.University0/UndergraduateStudent360
Department1.University0/UndergraduateStudent137
Department0.University2/UndergraduateStudent115
Department0.University3/UndergraduateStudent67
Department0.University3/UndergraduateStudent249
Department1.University0/UndergraduateStudent93
Department0.University2/UndergraduateStudent46
Department0.University3/GraduateCourse40
Department1.University0/UndergraduateStudent63
Department0.University3/UndergraduateStudent234
Department0.University3/GraduateStudent112
Department0.University3/UndergraduateStudent77
Department1.University0/UndergraduateStudent102
Department1.University0/UndergraduateStudent142
Department0.University2/UndergraduateStudent60
Department0.University3/GraduateCourse28
Department1.University0/GraduateCourse34
Department0.University2/UndergraduateStudent51
Department1.University0/UndergraduateStudent59
Department1.University0/GraduateCourse35
Department0.University3/UndergraduateStudent316
Department0.University2/UndergraduateStudent236
Department0.University3/UndergraduateStudent133
Department0.University2/UndergraduateStudent76
Department1.University0/UndergraduateStudent288
Department0.University2/UndergraduateStudent265
Department0.University2/UndergraduateStudent53
Department1.University0/UndergraduateStudent119
Department0.University3/UndergraduateStudent164
Department0.University3/UndergraduateStudent177
Department0.University3/UndergraduateStudent172
Department1.University0/GraduateCourse9
Department1.University0/UndergraduateStudent131
Department0.University3/UndergraduateStudent114
Department0.University2/UndergraduateStudent340
Department0.University2/UndergraduateStudent259
Department1.University0/UndergraduateStudent113
Department0.University3/GraduateCourse0
Department0.University3/UndergraduateStudent173
Department0.University3/GraduateCourse37
Department1.University0/UndergraduateStudent184
Department0.University2/UndergraduateStudent297
Department1.University0/UndergraduateStudent209
Department0.University3/UndergraduateStudent276
Department0.University3/UndergraduateStudent399
Department0.University2/UndergraduateStudent271
Department0.University2/UndergraduateStudent288
Department0.University3/UndergraduateStudent230
Department0.University3/UndergraduateStudent127
Department0.University3/UndergraduateStudent264
Department0.University2/UndergraduateStudent258
Department0.University2/UndergraduateStudent156
Department0.University2/UndergraduateStudent200
Department0.University3/GraduateCourse3
Department0.University3/UndergraduateStudent306
Department0.University2/UndergraduateStudent212
Department1.University0/UndergraduateStudent296
Department1.University0/UndergraduateStudent12
Department0.University2/UndergraduateStudent65
Department0.University2/UndergraduateStudent19
Department1.University0/UndergraduateStudent352
Department1.University0/UndergraduateStudent154
Department1.University0/UndergraduateStudent69
Department0.University2/UndergraduateStudent171
Department0.University3/UndergraduateStudent94
Department0.University2/UndergraduateStudent365
Department0.University3/UndergraduateStudent417
Department0.University3/UndergraduateStudent11
Department0.University3/UndergraduateStudent190
Department1.University0/UndergraduateStudent60
Department0.University2/UndergraduateStudent206
Department0.University2/GraduateStudent70
Department0.University2/UndergraduateStudent307
Department0.University2/UndergraduateStudent256
Department1.University0/UndergraduateStudent281
Department0.University2/UndergraduateStudent113
Department0.University3/UndergraduateStudent345
Department0.University3/UndergraduateStudent355
Department0.University2/UndergraduateStudent137
Department0.University3/UndergraduateStudent88
Department0.University2/UndergraduateStudent329
Department1.University0/UndergraduateStudent56
Department0.University3/GraduateCourse17
Department0.University3/UndergraduateStudent324
Department0.University2/UndergraduateStudent175
Department1.University0/UndergraduateStudent317
Department0.University2/UndergraduateStudent129
Department1.University0/UndergraduateStudent298
Department0.University3/UndergraduateStudent273
Department0.University2/GraduateCourse12
Department1.University0/GraduateStudent25
Department1.University0/UndergraduateStudent77
Department0.University3/UndergraduateStudent286
Department0.University3/UndergraduateStudent148
Department0.University3/UndergraduateStudent38
Department0.University3/GraduateCourse2
Department1.University0/UndergraduateStudent278
Department1.University0/UndergraduateStudent261
Department0.University3/UndergraduateStudent340
Department0.University2/UndergraduateStudent29
Department1.University0/UndergraduateStudent92
Department0.University2/UndergraduateStudent281
Department1.University0/UndergraduateStudent187
Department1.University0/UndergraduateStudent163
Department0.University2/UndergraduateStudent313
Department0.University3/UndergraduateStudent353
Department1.University0/UndergraduateStudent359
Department0.University2/UndergraduateStudent342
Department1.University0/UndergraduateStudent291
Department0.University3/UndergraduateStudent146
Department0.University3/UndergraduateStudent158
Department0.University3/UndergraduateStudent58
Department0.University2/UndergraduateStudent238
Department0.University3/UndergraduateStudent100
Department0.University2/UndergraduateStudent266
Department1.University0/UndergraduateStudent315
Department1.University0/UndergraduateStudent396
Department0.University2/UndergraduateStudent196
Department1.University0/UndergraduateStudent369
Department0.University2/UndergraduateStudent71
Department1.University0/UndergraduateStudent45
Department0.University3/UndergraduateStudent281
Department1.University0/UndergraduateStudent390
Department0.University3/UndergraduateStudent370
Department0.University3/UndergraduateStudent333
Department0.University3/UndergraduateStudent319
Department0.University3/UndergraduateStudent311
Department1.University0/UndergraduateStudent402
Department0.University3/UndergraduateStudent50
Department0.University2/UndergraduateStudent49
Department1.University0/UndergraduateStudent384
Department1.University0/UndergraduateStudent199
Department1.University0/UndergraduateStudent80
Department0.University3/GraduateCourse12
Department0.University3/GraduateStudent17
Department1.University0/UndergraduateStudent204
Department0.University2/UndergraduateStudent68
Department1.University0/UndergraduateStudent114
Department0.University2/GraduateStudent108
Department0.University2/UndergraduateStudent62
Department1.University0/UndergraduateStudent48
Department1.University0/UndergraduateStudent138
Department0.University3/UndergraduateStudent217
Department0.University2/UndergraduateStudent90
Department0.University2/UndergraduateStudent153
Department0.University2/UndergraduateStudent320
Department0.University3/GraduateCourse8
Department0.University3/UndergraduateStudent366
Department0.University3/UndergraduateStudent25
Department0.University2/UndergraduateStudent32
Department0.University2/UndergraduateStudent356
Department0.University2/UndergraduateStudent255
Department0.University2/UndergraduateStudent44
Department0.University3/UndergraduateStudent390
Department0.University2/UndergraduateStudent277
Department1.University0/UndergraduateStudent52
Department0.University3/UndergraduateStudent41
Department0.University3/UndergraduateStudent401
Department0.University3/UndergraduateStudent194
Department0.University3/UndergraduateStudent243
Department1.University0/UndergraduateStudent58
Department1.University0/UndergraduateStudent254
Department0.University3/UndergraduateStudent307
Department1.University0/GraduateCourse6
Department0.University2/UndergraduateStudent23
Department0.University3/UndergraduateStudent359
Department0.University3/UndergraduateStudent23
Department0.University2/UndergraduateStudent27
Department0.University3/UndergraduateStudent15
Department1.University0/UndergraduateStudent282
Department0.University2/UndergraduateStudent287
Department1.University0/UndergraduateStudent363
Department0.University2/UndergraduateStudent107
Department0.University2/UndergraduateStudent84
Department0.University3/UndergraduateStudent346
Department0.University3/UndergraduateStudent242
Department0.University3/UndergraduateStudent113
Department0.University3/GraduateStudent20
Department0.University2/UndergraduateStudent77
Department1.University0/UndergraduateStudent115
Department0.University3/UndergraduateStudent171
Department0.University2/GraduateStudent60
Department0.University3/UndergraduateStudent312
"Research16"
Department1.University0/UndergraduateStudent403
Department0.University2/UndergraduateStudent352
Department0.University3/UndergraduateStudent256
Department0.University3/UndergraduateStudent40
Department0.University3/GraduateCourse13
Department0.University2/UndergraduateStudent164
Department0.University3/UndergraduateStudent192
Department0.University3/UndergraduateStudent279
Department1.University0/UndergraduateStudent382
Department1.University0/UndergraduateStudent212
Department0.University3/UndergraduateStudent110
Department0.University3/GraduateStudent105
Department1.University0/UndergraduateStudent11
Department1.University0/UndergraduateStudent108
Department1.University0/UndergraduateStudent130
Department0.University3/UndergraduateStudent352
Department0.University2/UndergraduateStudent69
Department1.University0/UndergraduateStudent321
Department1.University0/UndergraduateStudent253
Department0.University2/UndergraduateStudent36
Department1.University0/UndergraduateStudent82
Department0.University3/UndergraduateStudent205
Department1.University0/UndergraduateStudent7
Department0.University2/UndergraduateStudent134
Department0.University3/UndergraduateStudent160
Department0.University2/UndergraduateStudent159
Department0.University3/UndergraduateStudent360
Department0.University2/UndergraduateStudent181
Department0.University2/GraduateStudent119
Department0.University3/UndergraduateStudent17
Department0.University3/UndergraduateStudent96
Department1.University0/UndergraduateStudent310
Department0.University3/UndergraduateStudent120
Department0.University3/UndergraduateStudent385
Department0.University2/GraduateCourse16
Department1.University0/UndergraduateStudent57
Department0.University3/UndergraduateStudent258
Department0.University3/UndergraduateStudent213
Department0.University3/UndergraduateStudent245
Department0.University3/GraduateStudent29
Department0.University3/UndergraduateStudent394
Department0.University3/UndergraduateStudent403
Department1.University0/UndergraduateStudent15
Department1.University0/UndergraduateStudent256
Department0.University3/UndergraduateStudent154
Department0.University2/UndergraduateStudent24
Department0.University3/UndergraduateStudent162
Department0.University3/UndergraduateStudent152
Department0.University2/UndergraduateStudent178
Department1.University0/UndergraduateStudent392
Department0.University3/UndergraduateStudent317
Department1.University0/GraduateCourse36
Department0.University3/UndergraduateStudent400
Department0.University3/UndergraduateStudent97
Department0.University2/GraduateCourse17
Department1.University0/UndergraduateStudent152
Department0.University3/UndergraduateStudent14
Department0.University2/UndergraduateStudent4
Department0.University3/UndergraduateStudent322
Department0.University3/GraduateCourse22
Department0.University3/UndergraduateStudent196
Department0.University3/UndergraduateStudent250
Department0.University3/UndergraduateStudent32
Department0.University2/UndergraduateStudent183
Department0.University3/UndergraduateStudent263
Department1.University0/UndergraduateStudent299
Department1.University0/UndergraduateStudent50
Department0.University2/UndergraduateStudent101
Department0.University3/UndergraduateStudent157
Department0.University2/UndergraduateStudent361
Department0.University2/UndergraduateStudent42
Department1.University0/UndergraduateStudent176
Department0.University3/UndergraduateStudent289
Department0.University3/UndergraduateStudent330
Department0.University3/UndergraduateStudent144
Department0.University3/UndergraduateStudent48
Department0.University3/UndergraduateStudent397
Department0.University2/UndergraduateStudent155
Department0.University3/UndergraduateStudent309
Department0.University3/UndergraduateStudent351
Department1.University0/UndergraduateStudent214
Department0.University3/UndergraduateStudent131
Department0.University3/UndergraduateStudent126
Department1.University0/UndergraduateStudent260
Department0.University3/UndergraduateStudent30
Department0.University2/UndergraduateStudent197
"Publication18"
Department0.University3/UndergraduateStudent76
Department0.University2/UndergraduateStudent274
Department1.University0/GraduateCourse13
Department0.University3/UndergraduateStudent364
Department1.University0/UndergraduateStudent210
Department1.University0/GraduateCourse5
Department0.University3/UndergraduateStudent63
Department0.University3/UndergraduateStudent377
Department1.University0/UndergraduateStudent81
Department0.University3/UndergraduateStudent124
Department0.University3/UndergraduateStudent137
Department0.University2/UndergraduateStudent94
Department0.University3/UndergraduateStudent167
Department0.University3/UndergraduateStudent292
Department0.University2/UndergraduateStudent240
Department0.University2/UndergraduateStudent120
Department0.University3/UndergraduateStudent149
Department0.University3/UndergraduateStudent334
Department0.University3/UndergraduateStudent51
Department0.University2/UndergraduateStudent344
Department0.University3/UndergraduateStudent104
Department0.University2/GraduateCourse13
Department0.University3/UndergraduateStudent64
Department0.University3/UndergraduateStudent206
Department0.University3/UndergraduateStudent147
Department1.University0/UndergraduateStudent44
Department0.University2/UndergraduateStudent66
Department1.University0/UndergraduateStudent366
Department0.University3/UndergraduateStudent68
Department0.University2/GraduateCourse21
Department1.University0/UndergraduateStudent155
Department0.University2/UndergraduateStudent207
Department0.University2/UndergraduateStudent116
Department0.University3/UndergraduateStudent225
Department1.University0/UndergraduateStudent342
Department0.University3/GraduateStudent118
Department0.University3/UndergraduateStudent261
Department1.University0/UndergraduateStudent239
Department0.University3/UndergraduateStudent203
Department0.University2/UndergraduateStudent1
Department1.University0/UndergraduateStudent286
Department1.University0/UndergraduateStudent200
Department0.University2/UndergraduateStudent269
Department0.University3/UndergraduateStudent42
Department1.University0/GraduateCourse43
Department0.University3/UndergraduateStudent208
Department0.University3/UndergraduateStudent259
Department0.University3/GraduateStudent47
Department0.University3/UndergraduateStudent300
Department0.University3/UndergraduateStudent6
Department0.University3/UndergraduateStudent232
Department0.University3/UndergraduateStudent18
Department0.University3/UndergraduateStudent339
Department1.University0/UndergraduateStudent305
Department0.University3/UndergraduateStudent13
Department1.University0/UndergraduateStudent387
Department0.University2/GraduateCourse37
Department1.University0/UndergraduateStudent207
Department1.University0/UndergraduateStudent106
Department0.University2/UndergraduateStudent93
Department0.University3/UndergraduateStudent368
Department1.University0/UndergraduateStudent234
Department0.University2/UndergraduateStudent100
Department0.University2/UndergraduateStudent106
Department1.University0/UndergraduateStudent139
Department0.University3/UndergraduateStudent304
Department0.University3/UndergraduateStudent21
Department0.University2/UndergraduateStudent208
Department0.University3/UndergraduateStudent34
Department1.University0/UndergraduateStudent186
